<template>
  <div class="text">
    <center class="my-5">
      <h1 id="highlight">ຈຸດປະສົງ ແລະ ເປົ້າໝາຍຂອງກຸ່ມ</h1>
    </center>
    <ul>
      <li>ພັດທະນາ , ປັບປຸງ , ອັບເດດເວັບໄຊ ແລະ ລະບົບຂອງພາກວິຊາ.</li>
      <li>ເຜີຍແຜ່ຄວາມຮູ້ທາງດ້ານການພັດທະນາທັງໃນດ້ານ Hard skill & Soft skill.</li>
      <li>ວິໄຈ ແລະ ພັດທະນາຜະລິດຕະພັນທາງດ້ານຊອບແວຂຶ້ນມານຳໃຊ້.</li>
      <li>ຝຶກອົບຮົມໃຫ້ຄວາມຮູ້ສະມາຊິກພາຍໃນກຸ່ມ ແລະນັກສຶກສາພາຍໃນພາກວິຊາ.</li>
    </ul>
    <center>
    <p class="mt-5">
      ນອກຈາກກຸ່ມຂອງພວກເຮົາຍັງໄດ້ພັດທະນາຜະລິດຕະພັນທາງດ້ານຊັອບແວຕ່າງໆຂຶ້ນມານຳໃຊ້ໃຫ້ເກີດປະໂຫຍດບໍ່ວ່າຈະເປັນ :
      Web site , Application , ລະບົບຕ່າງໆພາຍໃນພາກວິຊາ ແລະ ໃນກຸ່ມຂອງພວກເຮົາຍັງມີສະມາຊິກທີ່ມີຄວາມສາມາດໃນດ້ານຂອງ Cyber Security ອີກດ້ວຍ.ພວກເຮົາຍັງຜັກດັນໃຫ້ສະມາຊິກມີຄວາມກ້າໃນການເຂົ້າສູ່ເວທີການແຂ່ງຂັນຕ່າງໆເພື່ອຫາປະສົບການ ແລະ ພັດທະນະຂີດຄວາມສາມາດຂອງຕົນເອງຂື້ນໄປເລື່ອຍໆ.
    </p>
    </center>

  </div>
</template>

<script>
export default {};
</script>

<style scoped>
.text{
  font-size: 20px;
}
</style>
